nuclei-v3/S/sap-getversion-info.yaml

http:
- matchers:
  - part: body
    type: word
    words:
    - GetVersionInfoResponse
  - condition: and
    part: body
    type: word
    words:
    - <VersionInfo>
    - <Filename>
  - status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - "POST / HTTP/1.1\nHost: {{Hostname}}\nContent-Type: text/xml; charset=UTF-8\n\
    SOAPAction: '\"\"'\n\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<SOAP-ENV:Envelope\
    \ xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <SOAP-ENV:Header>\n\
    \    <sapsess:Session xmlns:sapsess=\"http://www.sap.com/webas/630/soap/features/session/\"\
    >\n      <enableSession>true</enableSession>\n    </sapsess:Session>\n  </SOAP-ENV:Header>\n\
    \  <SOAP-ENV:Body>\n    <ns1:GetVersionInfo xmlns:ns1=\"urn:SAPControl\"></ns1:GetVersionInfo>\n\
    \  </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n"
id: sap-getversion-info
info:
  author: LRVT,l4rm4nd
  description: 'Detected SAP systems where the SAP Start Service (sapstartsrv) SAPControl
    SOAP interface exposes the GetVersionInfo web method without authentication.

    '
  metadata:
    max-request: 1
  name: SAPControl GetVersionInfo - Detect
  reference:
  - https://github.com/rapid7/metasploit-framework/blob/master/modules/auxiliary/scanner/sap/sap_mgmt_con_version.rb
  - https://gist.github.com/c6da760f57e062397e52400936ca5797
  - https://www.neteye-blog.com/2017/03/sap-monitoring-experiences-with-sapcontrol-and-check_sap_health/
  severity: info
  tags: misconfig,sap,sapcontrol,soap,version
